## Data transformation is a set of techniques used to convert data from one format or structure to another format or structure.

## We can conacate Two dataFrame with
- dataframe = pd.concat([dataFrame1, dataFrame2], ignore_index=True) 
### Where,
- axis = 0 means it will concate below
- axis = 1 means it will Concate Side By Side

### For JOIN Operation in Python we use Merge 
- pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,left_index=False, right_index=False, sort=True)

Where,

Left = left Outer join

Right = Right outer join

Inner = Inner join

Outer = Full outer join

## we can Create DataFrame With 
- Pd.dataframes({K:v})

## Reshaping and pivoting 

During EDA, we often need to rearrange data in a dataframe in some consistent manner. This can be done with hierarchical indexing using two actions:

- Stacking: Stack rotates from any particular column in the data to the rows. 
- Unstacking: Unstack rotates from the rows into the column.

In [3]:
import numpy as np
import pandas as pd
data = np.arange(15).reshape((3,5))
indexers = ['Rainfall', 'Humidity', 'Wind']
dframe1 = pd.DataFrame(data, index=indexers, columns=['Bergen', 'Oslo', 'Trondheim', 'Stavanger', 'Kristiansand'])
dframe1

          Bergen  Oslo  Trondheim  Stavanger  Kristiansand
Rainfall       0     1          2          3             4
Humidity       5     6          7          8             9
Wind          10    11         12         13            14

In [4]:
stacked = dframe1.stack()
stacked

Rainfall  Bergen           0
          Oslo             1
          Trondheim        2
          Stavanger        3
          Kristiansand     4
Humidity  Bergen           5
          Oslo             6
          Trondheim        7
          Stavanger        8
          Kristiansand     9
Wind      Bergen          10
          Oslo            11
          Trondheim       12
          Stavanger       13
          Kristiansand    14
dtype: int32

In [5]:
stacked.unstack()

          Bergen  Oslo  Trondheim  Stavanger  Kristiansand
Rainfall       0     1          2          3             4
Humidity       5     6          7          8             9
Wind          10    11         12         13            14

In [6]:
## let's unstack the concatenated frame
series1 = pd.Series([000, 111, 222, 333], index=['zeros','ones', 'twos', 'threes'])
series2 = pd.Series([444, 555, 666], index=['fours', 'fives', 'sixs'])

frame2 = pd.concat([series1, series2], keys=['Number1', 'Number2'])
frame2.unstack()

         fives  fours   ones   sixs  threes   twos  zeros
Number1    NaN    NaN  111.0    NaN   333.0  222.0    0.0
Number2  555.0  444.0    NaN  666.0     NaN    NaN    NaN

## Removing Duplicate data 
- Checking duplicate = df.duplicated()
- Drop Duplicate  = df.drop_duplicate()

## Replacing value's
- df.replace(to_replace =value, value= np.nan) 

We can also replace multiple value at Once
- df.replace(to_replace =[value1, Value2....], value= [np.nan, Other value want to replace with])

## Handiling Missing value
- can Check with = df.isnull() or df.notnull()
- We can also sum the value of null = df.isnull().sum()

## droping missing value
- If we want to drop missing value in row  =  df.dropna(axis= 0 )
- with columns = df.dropna(axis = 1)

## Filling missing data
- filledDf = dfx.fillna(0)

## Backward and forward filling
- df.fillna(method='ffill')

Here, from the forward-filling technique, the last(top-Down) known value will fill the rest of NaN values.
- df.fillna(method='bfill')

Here, from the forward-filling technique, the last(Bottom-up) known value will fill the rest of NaN values.


## Renaming axis indexes
- Say, you want to transform the index terms to capital letter.

df.index = df.index.map(str.upper)

- for Title 

df.rename(index=str.title, columns=str.upper)

## Dummy variables

In [8]:
df = pd.DataFrame({'gender': ['female', 'female', 'male', 'unknown', 'male', 'female'], 'votes': range(6, 12, 1)})
df

    gender  votes
0   female      6
1   female      7
2     male      8
3  unknown      9
4     male     10
5   female     11

In [9]:
pd.get_dummies(df['gender'])

   female  male  unknown
0       1     0        0
1       1     0        0
2       0     1        0
3       0     0        1
4       0     1        0
5       1     0        0

In [10]:
dummies = pd.get_dummies(df['gender'], prefix='gender')
dummies

   gender_female  gender_male  gender_unknown
0              1            0               0
1              1            0               0
2              0            1               0
3              0            0               1
4              0            1               0
5              1            0               0

In [11]:
with_dummy = df[['votes']].join(dummies)
with_dummy

   votes  gender_female  gender_male  gender_unknown
0      6              1            0               0
1      7              1            0               0
2      8              0            1               0
3      9              0            0               1
4     10              0            1               0
5     11              1            0               0